In [5]:
from pandas import read_csv

In [6]:
filename = 'daily_retail_price_Onion-upto_apr_2015.csv'
header_names = ['Date','Centre_Name','Commodity_Name','Price']
data = read_csv(filename,names = header_names)

In [7]:
data

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

In [8]:
print(data.dtypes)

Date               object
Centre_Name        object
Commodity_Name     object
Price             float64
dtype: object

In [9]:
data.ndim

2

In [10]:
data.shape

(127911, 4)

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 127911 entries, 0 to 127910
Data columns (total 4 columns):
Date              127911 non-null object
Centre_Name       127911 non-null object
Commodity_Name    127911 non-null object
Price             115991 non-null float64
dtypes: float64(1), object(3)
memory usage: 3.9+ MB

In [13]:
data['Price'].sort_values()

16130     2.0
16094     2.0
16112     2.0
12008     2.0
37260     2.0
         ...
127813    NaN
127815    NaN
127866    NaN
127867    NaN
127886    NaN
Name: Price, Length: 127911, dtype: float64

In [14]:
data.sort_values('Price')

            Date Centre_Name Commodity_Name  Price
16130   19-07-01      BHOPAL          Onion    2.0
16094   17-07-01      BHOPAL          Onion    2.0
16112   18-07-01      BHOPAL          Onion    2.0
12008   11-08-00      BHOPAL          Onion    2.0
37260   28-04-06      BHOPAL          Onion    2.0
...          ...         ...            ...    ...
127813  27-04-15    SILIGURI          Onion    NaN
127815  27-04-15    ITANAGAR          Onion    NaN
127866  28-04-15     GWALIOR          Onion    NaN
127867  28-04-15    JABALPUR          Onion    NaN
127886  28-04-15    ITANAGAR          Onion    NaN

[127911 rows x 4 columns]

In [15]:
data.sort_values('Centre_Name')

            Date Centre_Name Commodity_Name  Price
36711   10-03-06    AGARTALA          Onion    8.0
73531   06-05-11    AGARTALA          Onion   14.0
38758   23-08-06    AGARTALA          Onion   10.0
5772    22-03-99    AGARTALA          Onion   10.0
26127   21-10-03    AGARTALA          Onion   18.0
...          ...         ...            ...    ...
124296  09-02-15     WAYANAD          Onion   45.0
126909  07-04-15     WAYANAD          Onion   41.0
127548  21-04-15     WAYANAD          Onion   41.0
123624  22-01-15     WAYANAD          Onion   41.0
124160  05-02-15     WAYANAD          Onion   45.0

[127911 rows x 4 columns]

In [15]:
data.sort_values('Price').head()

           Date Centre_Name Commodity_Name  Price
16130  19-07-01      BHOPAL          Onion    2.0
16094  17-07-01      BHOPAL          Onion    2.0
16112  18-07-01      BHOPAL          Onion    2.0
12008  11-08-00      BHOPAL          Onion    2.0
37260  28-04-06      BHOPAL          Onion    2.0

In [28]:
data.sort_values('Price',ascending=False)

            Date Centre_Name Commodity_Name  Price
106332  13-11-13      AIZWAL          Onion  100.0
107016  02-12-13      AIZWAL          Onion  100.0
105933  04-11-13      AIZWAL          Onion  100.0
106161  08-11-13      AIZWAL          Onion  100.0
106047  06-11-13      AIZWAL          Onion  100.0
...          ...         ...            ...    ...
127813  27-04-15    SILIGURI          Onion    NaN
127815  27-04-15    ITANAGAR          Onion    NaN
127866  28-04-15     GWALIOR          Onion    NaN
127867  28-04-15    JABALPUR          Onion    NaN
127886  28-04-15    ITANAGAR          Onion    NaN

[127911 rows x 4 columns]

In [12]:
data.sort_values('Price',ascending=False)

            Date Centre_Name Commodity_Name  Price
106332  13-11-13      AIZWAL          Onion  100.0
107016  02-12-13      AIZWAL          Onion  100.0
105933  04-11-13      AIZWAL          Onion  100.0
106161  08-11-13      AIZWAL          Onion  100.0
106047  06-11-13      AIZWAL          Onion  100.0
...          ...         ...            ...    ...
127813  27-04-15    SILIGURI          Onion    NaN
127815  27-04-15    ITANAGAR          Onion    NaN
127866  28-04-15     GWALIOR          Onion    NaN
127867  28-04-15    JABALPUR          Onion    NaN
127886  28-04-15    ITANAGAR          Onion    NaN

[127911 rows x 4 columns]

this is a header

In [13]:
data.shape

# THIS IS A HEADER

(127911, 4)

In [16]:
data.head

<bound method NDFrame.head of             Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]>

In [19]:
data.head()

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0
2  25-11-97     LUCKNOW          Onion    5.0
3  25-11-97   AHMEDABAD          Onion    6.0
4  25-11-97      BHOPAL          Onion    8.0

In [20]:
data.tail()

            Date      Centre_Name Commodity_Name  Price
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

In [21]:
data.tail(10)

            Date      Centre_Name Commodity_Name  Price
127901  28-04-15         THRISSUR          Onion   30.0
127902  28-04-15         PALAKKAD          Onion   24.0
127903  28-04-15          WAYANAD          Onion   41.0
127904  28-04-15       PUDUCHERRY          Onion   18.0
127905  28-04-15          CHENNAI          Onion   19.0
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

In [15]:
data['Date']

0         25-11-97
1         25-11-97
2         25-11-97
3         25-11-97
4         25-11-97
            ...
127906    28-04-15
127907    28-04-15
127908    28-04-15
127909    28-04-15
127910    28-04-15
Name: Date, Length: 127911, dtype: object

In [16]:
data['Centre_Name']

0                   DELHI
1                  SHIMLA
2                 LUCKNOW
3               AHMEDABAD
4                  BHOPAL
               ...
127906           DINDIGUL
127907    THIRUCHIRAPALLI
127908         COIMBATORE
127909        TIRUNELVELI
127910          HYDERABAD
Name: Centre_Name, Length: 127911, dtype: object

In [25]:
data['Centre_Name'].nunique()

72

In [26]:
data['Centre_Name'].unique()

array(['DELHI', 'SHIMLA', 'LUCKNOW', 'AHMEDABAD', 'BHOPAL', 'MUMBAI',
       'JAIPUR', 'PATNA', 'BHUBANESHWAR', 'KOLKATA', 'GUWAHATI',
       'SHILLONG', 'AIZWAL', 'AGARTALA', 'BENGALURU', 'T.PURAM',
       'CHENNAI', 'HYDERABAD', 'CHANDIGARH', 'SRINAGAR', 'JAMMU',
       'AMRITSAR', 'LUDHIANA', 'DEHRADUN', 'RAIPUR', 'RANCHI', 'KOHIMA',
       'KANPUR', 'RAJKOT', 'VIJAYWADA', 'DINDIGUL', 'HISAR', 'KARNAL',
       'MANDI', 'BATHINDA', 'VARANASI', 'AGRA', 'INDORE', 'NAGPUR',
       'JODHPUR', 'KOTA', 'BHAGALPUR', 'CUTTACK', 'SAMBALPUR', 'SILIGURI',
       'ITANAGAR', 'DIMAPUR', 'DHARWAD', 'THIRUCHIRAPALLI', 'ERNAKULAM',
       'PORT BLAIR', 'PUDUCHERRY', 'PANAJI', 'GWALIOR', 'JABALPUR',
       'KOZHIKODE', 'ROURKELA', 'VISAKHAPATNAM', 'PANCHKULA', 'GURGAON',
       'REWA', 'SAGAR', 'COIMBATORE', 'TIRUNELVELI', 'PURNIA', 'THRISSUR',
       'PALAKKAD', 'WAYANAD', 'HALDWANI', 'DHARAMSHALA', 'MANGALORE',
       'MYSORE'], dtype=object)

In [16]:
data['Centre_Name'].value_counts()

JAIPUR         4292
MUMBAI         4292
SHILLONG       4292
GUWAHATI       4292
PATNA          4292
               ...
PALAKKAD         68
HALDWANI         54
DHARAMSHALA      27
MYSORE           22
MANGALORE        22
Name: Centre_Name, Length: 72, dtype: int64

In [29]:
data.drop(['Date', 'Commodity_Name'],axis=1)

            Centre_Name  Price
0                 DELHI    8.0
1                SHIMLA    7.0
2               LUCKNOW    5.0
3             AHMEDABAD    6.0
4                BHOPAL    8.0
...                 ...    ...
127906         DINDIGUL   18.0
127907  THIRUCHIRAPALLI   18.0
127908       COIMBATORE   18.0
127909      TIRUNELVELI   18.0
127910        HYDERABAD   22.0

[127911 rows x 2 columns]

In [30]:
data.drop(columns=['Date', 'Commodity_Name'])

            Centre_Name  Price
0                 DELHI    8.0
1                SHIMLA    7.0
2               LUCKNOW    5.0
3             AHMEDABAD    6.0
4                BHOPAL    8.0
...                 ...    ...
127906         DINDIGUL   18.0
127907  THIRUCHIRAPALLI   18.0
127908       COIMBATORE   18.0
127909      TIRUNELVELI   18.0
127910        HYDERABAD   22.0

[127911 rows x 2 columns]

In [31]:
data

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

In [19]:
data['Date'] #print(data['Date', 'Commodity_Name'])

0         25-11-97
1         25-11-97
2         25-11-97
3         25-11-97
4         25-11-97
            ...
127906    28-04-15
127907    28-04-15
127908    28-04-15
127909    28-04-15
127910    28-04-15
Name: Date, Length: 127911, dtype: object

In [165]:
data[['Date', 'Commodity_Name']]

            Date Commodity_Name
0       25-11-97          Onion
1       25-11-97          Onion
2       25-11-97          Onion
3       25-11-97          Onion
4       25-11-97          Onion
...          ...            ...
127906  28-04-15          Onion
127907  28-04-15          Onion
127908  28-04-15          Onion
127909  28-04-15          Onion
127910  28-04-15          Onion

[127911 rows x 2 columns]

In [35]:
data.sort_values('Price')

            Date Centre_Name Commodity_Name  Price
16130   19-07-01      BHOPAL          Onion    2.0
16094   17-07-01      BHOPAL          Onion    2.0
16112   18-07-01      BHOPAL          Onion    2.0
12008   11-08-00      BHOPAL          Onion    2.0
37260   28-04-06      BHOPAL          Onion    2.0
...          ...         ...            ...    ...
127813  27-04-15    SILIGURI          Onion    NaN
127815  27-04-15    ITANAGAR          Onion    NaN
127866  28-04-15     GWALIOR          Onion    NaN
127867  28-04-15    JABALPUR          Onion    NaN
127886  28-04-15    ITANAGAR          Onion    NaN

[127911 rows x 4 columns]

In [117]:
list(data['Price'].sort_values())

[2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.75,
 2.75,
 2.75,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 ...]

In [36]:
data['Price'].sort_values()

16130     2.0
16094     2.0
16112     2.0
12008     2.0
37260     2.0
         ...
127813    NaN
127815    NaN
127866    NaN
127867    NaN
127886    NaN
Name: Price, Length: 127911, dtype: float64

In [17]:
data[data.columns[1:3]]

            Centre_Name Commodity_Name
0                 DELHI          Onion
1                SHIMLA          Onion
2               LUCKNOW          Onion
3             AHMEDABAD          Onion
4                BHOPAL          Onion
...                 ...            ...
127906         DINDIGUL          Onion
127907  THIRUCHIRAPALLI          Onion
127908       COIMBATORE          Onion
127909      TIRUNELVELI          Onion
127910        HYDERABAD          Onion

[127911 rows x 2 columns]

In [38]:
data.loc[:,['Centre_Name', 'Price']]

            Centre_Name  Price
0                 DELHI    8.0
1                SHIMLA    7.0
2               LUCKNOW    5.0
3             AHMEDABAD    6.0
4                BHOPAL    8.0
...                 ...    ...
127906         DINDIGUL   18.0
127907  THIRUCHIRAPALLI   18.0
127908       COIMBATORE   18.0
127909      TIRUNELVELI   18.0
127910        HYDERABAD   22.0

[127911 rows x 2 columns]

In [20]:
data.loc[110:120:,['Date', 'Price']]

         Date  Price
110  03-12-97    6.0
111  03-12-97    7.0
112  03-12-97    8.0
113  03-12-97   10.0
114  03-12-97    6.0
115  03-12-97   10.5
116  03-12-97    9.0
117  03-12-97   11.0
118  03-12-97    NaN
119  03-12-97   18.0
120  03-12-97    9.0

In [39]:
print(data.loc[data['Price'] < 20, ['Price', 'Commodity_Name']]) 
print("\n -- iloc -- \n")
print(data.iloc[(data['Price'] < 30).values, [1, 3]])

        Price Commodity_Name
0         8.0          Onion
1         7.0          Onion
2         5.0          Onion
3         6.0          Onion
4         8.0          Onion
...       ...            ...
127905   19.0          Onion
127906   18.0          Onion
127907   18.0          Onion
127908   18.0          Onion
127909   18.0          Onion

[81899 rows x 2 columns]

 -- iloc --

            Centre_Name  Price
0                 DELHI    8.0
1                SHIMLA    7.0
2               LUCKNOW    5.0
3             AHMEDABAD    6.0
4                BHOPAL    8.0
...                 ...    ...
127906         DINDIGUL   18.0
127907  THIRUCHIRAPALLI   18.0
127908       COIMBATORE   18.0
127909      TIRUNELVELI   18.0
127910        HYDERABAD   22.0

[104357 rows x 2 columns]

In [40]:
data.loc[10:20:,'Commodity_Name':'Price']

   Commodity_Name  Price
10          Onion    8.0
11          Onion    9.0
12          Onion    9.0
13          Onion    9.0
14          Onion    6.0
15          Onion    6.5
16          Onion    5.0
17          Onion    6.0
18          Onion    8.0
19          Onion    7.0
20          Onion    5.0

In [37]:
data.loc[10:20,'Commodity_Name':'Price']

   Commodity_Name  Price
10          Onion    8.0
11          Onion    9.0
12          Onion    9.0
13          Onion    9.0
14          Onion    6.0
15          Onion    6.5
16          Onion    5.0
17          Onion    6.0
18          Onion    8.0
19          Onion    7.0
20          Onion    5.0

In [45]:
data.iloc[10:20,-1]

10    8.0
11    9.0
12    9.0
13    9.0
14    6.0
15    6.5
16    5.0
17    6.0
18    8.0
19    7.0
Name: Price, dtype: float64

In [43]:
data.loc[0,:]

Date              25-11-97
Centre_Name          DELHI
Commodity_Name       Onion
Price                    8
Name: 0, dtype: object

In [44]:
data.loc[0:4,:]

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0
2  25-11-97     LUCKNOW          Onion    5.0
3  25-11-97   AHMEDABAD          Onion    6.0
4  25-11-97      BHOPAL          Onion    8.0

In [21]:
data.iloc[:,1:4]

            Centre_Name Commodity_Name  Price
0                 DELHI          Onion    8.0
1                SHIMLA          Onion    7.0
2               LUCKNOW          Onion    5.0
3             AHMEDABAD          Onion    6.0
4                BHOPAL          Onion    8.0
...                 ...            ...    ...
127906         DINDIGUL          Onion   18.0
127907  THIRUCHIRAPALLI          Onion   18.0
127908       COIMBATORE          Onion   18.0
127909      TIRUNELVELI          Onion   18.0
127910        HYDERABAD          Onion   22.0

[127911 rows x 3 columns]

In [131]:
data.loc[0:4,:]

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0
2  25-11-97     LUCKNOW          Onion    5.0
3  25-11-97   AHMEDABAD          Onion    6.0
4  25-11-97      BHOPAL          Onion    8.0

In [46]:
data.drop(columns=['Date', 'Commodity_Name'])

            Centre_Name  Price
0                 DELHI    8.0
1                SHIMLA    7.0
2               LUCKNOW    5.0
3             AHMEDABAD    6.0
4                BHOPAL    8.0
...                 ...    ...
127906         DINDIGUL   18.0
127907  THIRUCHIRAPALLI   18.0
127908       COIMBATORE   18.0
127909      TIRUNELVELI   18.0
127910        HYDERABAD   22.0

[127911 rows x 2 columns]

In [48]:
data.rename(columns={"Date": "Date_of_Sale"})

       Date_of_Sale      Centre_Name Commodity_Name  Price
0          25-11-97            DELHI          Onion    8.0
1          25-11-97           SHIMLA          Onion    7.0
2          25-11-97          LUCKNOW          Onion    5.0
3          25-11-97        AHMEDABAD          Onion    6.0
4          25-11-97           BHOPAL          Onion    8.0
...             ...              ...            ...    ...
127906     28-04-15         DINDIGUL          Onion   18.0
127907     28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908     28-04-15       COIMBATORE          Onion   18.0
127909     28-04-15      TIRUNELVELI          Onion   18.0
127910     28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

In [49]:
data

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

In [134]:
data = data.rename(columns={"Date_of_Sale": "Date"})
data

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

In [135]:
# Single selections using iloc and DataFrame
# Rows:
data.iloc[0] # first row of data frame

Date              25-11-97
Centre_Name          DELHI
Commodity_Name       Onion
Price                    8
Name: 0, dtype: object

In [136]:
data.iloc[1] # second row of data frame

Date              25-11-97
Centre_Name         SHIMLA
Commodity_Name       Onion
Price                    7
Name: 1, dtype: object

In [137]:
data.iloc[:,-1] # last row of data frame [3:9,1:3p
print(data.iloc[5:10, 1:4])
print(data.iloc[:,3])
print(4,3)
#print(data.iloc[:,-1])

    Centre_Name Commodity_Name  Price
5        MUMBAI          Onion    7.0
6        JAIPUR          Onion    6.0
7         PATNA          Onion    NaN
8  BHUBANESHWAR          Onion    9.0
9       KOLKATA          Onion   11.0
0          8.0
1          7.0
2          5.0
3          6.0
4          8.0
          ...
127906    18.0
127907    18.0
127908    18.0
127909    18.0
127910    22.0
Name: Price, Length: 127911, dtype: float64
4 3

In [138]:
data.iloc[:,0] # first column of data frame

0         25-11-97
1         25-11-97
2         25-11-97
3         25-11-97
4         25-11-97
            ...
127906    28-04-15
127907    28-04-15
127908    28-04-15
127909    28-04-15
127910    28-04-15
Name: Date, Length: 127911, dtype: object

In [139]:
data.iloc[:,1] # second column of data frame

0                   DELHI
1                  SHIMLA
2                 LUCKNOW
3               AHMEDABAD
4                  BHOPAL
               ...
127906           DINDIGUL
127907    THIRUCHIRAPALLI
127908         COIMBATORE
127909        TIRUNELVELI
127910          HYDERABAD
Name: Centre_Name, Length: 127911, dtype: object

In [56]:
data.iloc[:,-1] # last column of data frame

0          8.0
1          7.0
2          5.0
3          6.0
4          8.0
          ...
127906    18.0
127907    18.0
127908    18.0
127909    18.0
127910    22.0
Name: Price, Length: 127911, dtype: float64

In [141]:
print(data.iloc[0:5]) # first five rows of dataframe

print(data.iloc[:, 0:2]) # first two columns of data frame with all rows

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0
2  25-11-97     LUCKNOW          Onion    5.0
3  25-11-97   AHMEDABAD          Onion    6.0
4  25-11-97      BHOPAL          Onion    8.0
            Date      Centre_Name
0       25-11-97            DELHI
1       25-11-97           SHIMLA
2       25-11-97          LUCKNOW
3       25-11-97        AHMEDABAD
4       25-11-97           BHOPAL
...          ...              ...
127906  28-04-15         DINDIGUL
127907  28-04-15  THIRUCHIRAPALLI
127908  28-04-15       COIMBATORE
127909  28-04-15      TIRUNELVELI
127910  28-04-15        HYDERABAD

[127911 rows x 2 columns]

In [142]:
print(data.iloc[[0,3,6,24], [0,2,3]])

print(data.iloc[0:5, 2:4])

        Date Commodity_Name  Price
0   25-11-97          Onion    8.0
3   25-11-97          Onion    6.0
6   25-11-97          Onion    6.0
24  26-11-97          Onion    6.0
  Commodity_Name  Price
0          Onion    8.0
1          Onion    7.0
2          Onion    5.0
3          Onion    6.0
4          Onion    8.0

In [143]:
print(data.set_index("Date"))

              Centre_Name Commodity_Name  Price
Date
25-11-97            DELHI          Onion    8.0
25-11-97           SHIMLA          Onion    7.0
25-11-97          LUCKNOW          Onion    5.0
25-11-97        AHMEDABAD          Onion    6.0
25-11-97           BHOPAL          Onion    8.0
...                   ...            ...    ...
28-04-15         DINDIGUL          Onion   18.0
28-04-15  THIRUCHIRAPALLI          Onion   18.0
28-04-15       COIMBATORE          Onion   18.0
28-04-15      TIRUNELVELI          Onion   18.0
28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 3 columns]

In [57]:
data

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

In [171]:
print(data.set_index("Centre_Name",inplace=True))

None

In [174]:
data

                     Date Commodity_Name  Price
Centre_Name
DELHI            25-11-97          Onion    8.0
SHIMLA           25-11-97          Onion    7.0
LUCKNOW          25-11-97          Onion    5.0
AHMEDABAD        25-11-97          Onion    6.0
BHOPAL           25-11-97          Onion    8.0
...                   ...            ...    ...
DINDIGUL         28-04-15          Onion   18.0
THIRUCHIRAPALLI  28-04-15          Onion   18.0
COIMBATORE       28-04-15          Onion   18.0
TIRUNELVELI      28-04-15          Onion   18.0
HYDERABAD        28-04-15          Onion   22.0

[127911 rows x 3 columns]

In [146]:
print(data.reset_index(inplace=True))

None

In [148]:
data

            Centre_Name      Date Commodity_Name  Price
0                 DELHI  25-11-97          Onion    8.0
1                SHIMLA  25-11-97          Onion    7.0
2               LUCKNOW  25-11-97          Onion    5.0
3             AHMEDABAD  25-11-97          Onion    6.0
4                BHOPAL  25-11-97          Onion    8.0
...                 ...       ...            ...    ...
127906         DINDIGUL  28-04-15          Onion   18.0
127907  THIRUCHIRAPALLI  28-04-15          Onion   18.0
127908       COIMBATORE  28-04-15          Onion   18.0
127909      TIRUNELVELI  28-04-15          Onion   18.0
127910        HYDERABAD  28-04-15          Onion   22.0

[127911 rows x 4 columns]

In [46]:
data.iloc[0:2]

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0

In [49]:
data.iloc[0:3,0:4]

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0
2  25-11-97     LUCKNOW          Onion    5.0

In [50]:
data.iloc[0:3,0:3]

       Date Centre_Name Commodity_Name
0  25-11-97       DELHI          Onion
1  25-11-97      SHIMLA          Onion
2  25-11-97     LUCKNOW          Onion

In [54]:
data.iloc[3:7,1:3]

  Centre_Name Commodity_Name
3   AHMEDABAD          Onion
4      BHOPAL          Onion
5      MUMBAI          Onion
6      JAIPUR          Onion

In [56]:
data.iloc[:,1:3]

            Centre_Name Commodity_Name
0                 DELHI          Onion
1                SHIMLA          Onion
2               LUCKNOW          Onion
3             AHMEDABAD          Onion
4                BHOPAL          Onion
...                 ...            ...
127906         DINDIGUL          Onion
127907  THIRUCHIRAPALLI          Onion
127908       COIMBATORE          Onion
127909      TIRUNELVELI          Onion
127910        HYDERABAD          Onion

[127911 rows x 2 columns]

In [59]:
print(data.iloc[[0,3,6,24], [0,2,3]]) # you can select specific rows and specific columns

        Date Commodity_Name  Price
0   25-11-97          Onion    8.0
3   25-11-97          Onion    6.0
6   25-11-97          Onion    6.0
24  26-11-97          Onion    6.0